DiffusiveMixing/H-mixer/90deg/p1.0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8160;
        startFace       661360;
    }
    inlet_0
    {
        type            patch;
        nFaces          80;
        startFace       669520;
    }
    inlet_1
    {
        type            patch;
        nFaces          80;
        startFace       669600;
    }
    outlet_0
    {
        type            patch;
        nFaces          80;
        startFace       669680;
    }
    outlet_1
    {
        type            patch;
        nFaces          80;
        startFace       669760;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          665600;
        startFace       669840;
    }
)

// ************************************************************************* //
